InformationRegisters/ТоварыНацКаталогаИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ТоварыНацКаталогаИСМПТК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусКарточки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКарточекНацКаталогаИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КарточкаЗаполнена</Name>
					<Comment>Служебный признак</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатурыИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмеренияИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговаяМарка</Name>
					<Comment>brand_name</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИИН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>EAN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураИСМПТК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУпаковокИСМПТК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыКарточекНацКаталогаИСМПТК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыКарточекНацКаталогаИСМПТК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
					<Comment>draf</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаМодерации</Name>
					<Comment>moderation</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетИзменений</Name>
					<Comment>errors</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПодписания</Name>
					<Comment>notsigned</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Опубликована</Name>
					<Comment>published</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНДСПриИмпорте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаАкциза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиАкциза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКПВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРасчетаОблагаемойБазыАкциза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодакцизногоТМЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодакцизныхТМЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТовараЭСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНацКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ТоварыНацКаталогаИСМПТК/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//Временная заглушка
	ТекстИсключения = НСтр("ru='Форма объекта не предназначена для непосредственного открытия.'");
	ВызватьИсключение ТекстИсключения;
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.ИИН = ПолучитьИИНОрганизации(ИнтеграцияИСМПТКПереопределяемый.ПолучитьРеквизитИИНОрганизации());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Запись.ВидПродукции = ПолучитьВидПродукцииПоНоменклатуре();
	КонецЕсли;

	ЗаполнитьСведенияПоХарактеристикамИУпаковкам();
	УправлениеФормой();
		
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормыВыбора = Новый Структура("РежимВыбора", Истина); 
	
	ОсобенностьУчетаСписок = ИнтеграцияИСМПТККлиент.ПолучитьСписокДляОтбораМаркируемойПродукции();
	Отбор = Новый Структура;
	Отбор.Вставить("ОсобенностьУчета", ОсобенностьУчетаСписок);
	
	ПараметрыФормыВыбора.Вставить("Отбор", Отбор);
	ПараметрыФормыВыбора.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
		
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормыВыбора, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗарегистрироватьНовыйGTIN(Команда)
	
	ТекстВопроса   = ""; //Присвоить штрихкод
	ТекстСообщения = ""; //Штрихкод занят
	ВыполнитьПроверкиПоНоменклатуре(ТекстВопроса, ТекстСообщения);
	
	Если ЗначениеЗаполнено(ТекстВопроса) Тогда
		
		Дополнительныепараметры = Новый Структура();
		
		ДополнительныеПараметры.Вставить("Номенклатура",     Запись.Номенклатура);
		ДополнительныеПараметры.Вставить("Характеристика", 	 Запись.Характеристика);
		ДополнительныеПараметры.Вставить("EAN", 		     Запись.EAN);
		ДополнительныеПараметры.Вставить("GTIN", 		     Запись.GTIN);
		ДополнительныеПараметры.Вставить("ЕдиницаИзмерения", Запись.ЕдиницаИзмерения);
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение   = Новый ОписаниеОповещения("ПослеЗакрытияВопросаЗаписатьШтрихкодНоменклатуры", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьНоменклатуру(Команда)
	
	ДанныеДляПоиска = Новый Массив();
	ДанныеДляПоиска.Добавить(Запись.EAN);
	СведенияНоменклатуры = ИнтеграцияИСМПТКПереопределяемый.ПодобратьДанныеПоGTINДляЗаказа(ДанныеДляПоиска);
	
	Если СведенияНоменклатуры.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Штрихкод %1 не зарегистрирован в регистре штрихкодов номенклатуры!'");
		ТекстСообщения = ИнтеграцияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения, Запись.EAN);
		ИнтеграцияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
	Иначе
		Запись.Номенклатура   	= СведенияНоменклатуры[0].Номенклатура;
		Запись.Характеристика 	= СведенияНоменклатуры[0].Характеристика;
		Запись.ЕдиницаИзмерения = СведенияНоменклатуры[0].Упаковка;
		Запись.ВидПродукции 	= ПолучитьВидПродукцииПоНоменклатуре();
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	//Сведения карточки
	Если Запись.СтатусКарточки = ПредопределенноеЗначение("Перечисление.СтатусыКарточекНацКаталогаИСМПТК.Опубликована") Тогда
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПубликации", "Видимость", Истина);
	Иначе	
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДатаПубликации", "Видимость", Ложь);
	КонецЕсли;
	
	Элементы.СтатусКарточки.ЦветТекста = ИнтеграцияИСМПТККлиентСервер.ЦветСтатусаКарточкиНацКаталога(Запись.СтатусКарточки);
	
	//Команда регистрации штрихкода
	ТекстВопроса   = ""; //Присвоить штрихкод
	ТекстСообщения = ""; //Штрихкод занят
	ВыполнитьПроверкиПоНоменклатуре(ТекстВопроса, ТекстСообщения);
	Если ЗначениеЗаполнено(Запись.Номенклатура) И Не ЗначениеЗаполнено(ТекстСообщения) Тогда
		УстановитьВидимостьКомандыРегистрацииШтрихкода(Истина);
	Иначе
		УстановитьВидимостьКомандыРегистрацииШтрихкода(Ложь);
	КонецЕсли;
	//////////
	
	//Группа Товар
	ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПодобратьНоменклатуру", "Видимость", Не ЗначениеЗаполнено(Запись.Номенклатура));
	//////////
	
	Если Запись.СтатусКарточки = ПредопределенноеЗначение("Перечисление.СтатусыКарточекНацКаталогаИСМПТК.ОжидаетПодписания") Тогда 
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийТоварыНацКаталогаИСМПТКОпубликовать", "Видимость", Истина);
	Иначе
		ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаРегистрСведенийТоварыНацКаталогаИСМПТКОпубликовать", "Видимость", Ложь);
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаЗаписатьШтрихкодНоменклатуры(Результат, Параметры) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		
		Номенклатура = Параметры.Номенклатура;
		EAN 		 = Параметры.EAN;
		GTIN         = Параметры.GTIN;
		ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
		Характеристика 	 = Параметры.Характеристика;
		
		ИнтеграцияИСМПТКПереопределяемый.ЗаписатьШтрихкодНоменклатуры(Номенклатура, EAN, ЕдиницаИзмерения, Характеристика);
		ТекстСообщения = НСтр("ru='Штрихкод добавлен в регистр!'");
		ИнтеграцияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
		УстановитьВидимостьКомандыРегистрацииШтрихкода(Ложь);
		
	Исключение
		
		Информация = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru='Не удалось записать штрихкод номенклатуры по причине: %1'");
		ТекстСообщения = ИнтеграцияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения, КраткоеПредставлениеОшибки(Информация));
		ИнтеграцияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
		
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеШтрихкода(Номенклатура, EAN)
	
	Возврат ИнтеграцияИСМПТКПереопределяемый.ПроверитьНаличиеШтрихкодаУноменклатуры(Номенклатура, EAN);
	
КонецФункции

&НаСервере
Функция ПолучитьИИНОрганизации(ПараметрИИН)
	
	Возврат Запись.Организация[ПараметрИИН];
КонецФункции

&НаСервере
Процедура ВыполнитьПроверкиПоНоменклатуре(ТекстВопроса, ТекстСообщения) Экспорт
	
	РезультатПроверки =  ПроверитьНаличиеШтрихкода(Запись.Номенклатура, Запись.EAN);
	НоменклатураСоШтрихкодом = ?(РезультатПроверки.Количество() = 0, Неопределено, РезультатПроверки.Номенклатура);
	
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		
		Если НоменклатураСоШтрихкодом = Неопределено 
			И ((ХарактеристикиИспользуются И ЗначениеЗаполнено(Запись.Характеристика))
			ИЛИ Не ХарактеристикиИспользуются) Тогда
			
			ТекстВопроса = НСтр("ru = 'Добавить выбранной номенклатуре новый штрихкод на основании данных карточки товара?'");
			
		ИначеЕсли НоменклатураСоШтрихкодом <> Запись.Номенклатура Тогда 
			
			ТекстСообщения = НСтр("ru='Внимание: штрихкод %1 связан с номенклатурой %2'");
			ТекстСообщения = ИнтеграцияИСМПТККлиентСерверПереопределяемый.ПодставитьПараметрыВСтроку(ТекстСообщения, Запись.EAN, НоменклатураСоШтрихкодом);
			ИнтеграцияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
			
		Иначе
			
			ТекстСообщения = НСтр("ru='Номенклатура совпадает'");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.Характеристика) И ХарактеристикиИспользуются Тогда 
			ТекстСообщения = НСтр("ru='Внимание: необходимо заполнить характеристику!'");
			ИнтеграцияИСМПТККлиентСерверПереопределяемый.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьКомандыРегистрацииШтрихкода(ЗначениеСвойства)
	
	ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаЗарегистрироватьНовыйGTIN", "Видимость", ЗначениеСвойства);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидПродукцииПоНоменклатуре()
	
	Возврат ИнтеграцияИСМПТКПереопределяемый.ПолучитьВидПродукцииПоНоменклатуре(Запись.Номенклатура);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСведенияПоХарактеристикамИУпаковкам()
	
	ДанныеШК = Новый Массив();
	ДанныеШК.Добавить(Запись.EAN);
	ДанныеНоменклатуры = ИнтеграцияИСМПТКПереопределяемый.ПодобратьДанныеПоGTINДляЗаказа(ДанныеШК);
	Если Не ДанныеНоменклатуры.Количество() = 0 Тогда
		ХарактеристикаНоменклатуры = ДанныеНоменклатуры[0].Характеристика;
		УпаковкаНоменклатуры	   = ДанныеНоменклатуры[0].Упаковка;
	Иначе
		ХарактеристикаНоменклатуры = Неопределено;
		УпаковкаНоменклатуры	   = Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		//Характеристики
		Если ИнтеграцияИСМПТКПереопределяемый.ПроверитьИспользованиеХарактеристик() Тогда
			ХарактеристикиИспользуются = ИнтеграцияИСМПТКПереопределяемый.ПроверитьВедениеУчетаПоХарактеристикамУНоменклатуры(Запись.Номенклатура);
			ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Характеристика", "Видимость", ХарактеристикиИспользуются);	
			Если ХарактеристикиИспользуются Тогда
				Запись.Характеристика = ХарактеристикаНоменклатуры;
			Иначе
				Запись.Характеристика = Неопределено;
			КонецЕсли;				
		Иначе
			ХарактеристикиИспользуются = Ложь;
			ИнтерфейсИСМПТККлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Характеристика", "Видимость", Ложь);	
		КонецЕсли;
		
		//Упаковки
		Если Не ЗначениеЗаполнено(Запись.ЕдиницаИзмерения) Тогда
			Если ИнтеграцияИСМПТКПереопределяемый.ПроверитьИспользованиеУпаковок() Тогда
				//Упаковки используются
				Если Не ИнтеграцияИСМПТКПереопределяемый.ПроверитьВедениеУчетаПоУпаковкамУНоменклатуры(Запись.Номенклатура) Тогда
					//но не у этой позиции
					Запись.ЕдиницаИзмерения = ИнтеграцияИСМПТКПереопределяемый.ПолучитьСведенияОНоменклатуре(Запись.Номенклатура).ЕдиницаИзмерения;
				Иначе
					Запись.ЕдиницаИзмерения = УпаковкаНоменклатуры; 
				КонецЕсли;
			Иначе
				//Упаковки не используются
				Запись.ЕдиницаИзмерения = ИнтеграцияИСМПТКПереопределяемый.ПолучитьСведенияОНоменклатуре(Запись.Номенклатура).ЕдиницаИзмерения;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
